HeleShaw2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "parametersMesh"

scale   1;

vertices
(
    (0 0 0)
    ($xDir 0 0)
    ($xDir $yDir 0)
    (0 $yDir 0)
    (0 0 $zDir)
    ($xDir 0 $zDir)
    ($xDir $yDir $zDir)
    (0 $yDir $zDir)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xMesh $yMesh $zMesh) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
             (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (3 2 6 7)  // Top wall
            (0 1 5 4)  // Bottom wall
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //